Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 然后她弯曲大拇指，指向了自己，神采奕奕道：“但是我可不会答应，我宁姚喜欢的男人，一定要是全天下最厉害的剑仙，全天下！最厉害！大剑仙！什么道祖佛陀，什么儒家至圣，在他一剑之前，也要低头，都要让路！”
en_us: She then twisted her thumb and pointed at herself, saying with a buoyant expression, "However, I obviously won't agree. The man who I like will definitely be the most powerful Sword Immortal in the world. The most powerful! In the entire world! A great Sword Immortal! The Dao Ancestor and Buddha? The paramount Confucius? Standing before his sword, they'll have no option but to lower their heads and stand aside!"

source: 然后她指了指赵繇，“你爷爷还说，‘温良恭俭，初无甚奇，却倒是培子孙之元气者，必吾孙也！’”
en_us: She then pointed at Zhao Yao and said, "Your grandpa also said that being gentle, modest, and courteous, and being unextraordinary during one's early years, would be a sign of someone who was raised properly. And such a person would be no one else but his grandson!"

source: 然后她故意以一种漫不经心的语气说道：“那把压裙刀，回头你可以绑在手臂上，藏于袖中。”
en_us: She then continued in an intentionally nonchalant voice, "You can tie that skirt dagger to you arm and hide it within your sleeve."

source: 然后宋集薪邀功一般，抬头笑问道：“对吧，齐先生？”
en_us: He then looked up with a smile as if he were searching for praise and asked, "Isn't that right, Mr. Qi."

source: 然后少年指了指大骊藩王宋长镜，“那你得先问过他才行。”
en_us: He then pointed at Song Changjing as he continued, "If you want to gouge my eyes out, you'll have to ask him for permission first."

source: 然后少年笑道：“无论小镇外的天地，到底是盛世还是乱世，看来最少叔叔你已经做出了自己的选择。”
en_us: An amused smile then appeared on his face as he continued, "Having said that, regardless of whether the world outside the town is going through times of peace or unrest, at the very least, it seems like you've already made your choice."

source: 然后崔明皇望向名叫陈对的女子，关心问道：“陈姑娘你没事吧？”
en_us: He then turned to Chen Dui with a concerned expression and asked, "Are you alright, Chen Dui?"

source: 然后是极有可能是自己大道阻碍的蔡金简，暴毙于眼前，自己不但可以两手干净不染鲜血，还能白白得到她身上的两袋金精铜钱，说不定还能搜出一两件云霞山的秘宝，哪怕不是镇山之宝，也肯定差不到哪里去，他可不相信蔡金简全然没有护身符傍身。比如他苻南华，除了那块仅是障眼法的老龙布雨佩，就还带着两件品相极好、品阶极高的小东西，几乎算是老龙城压箱底宝物。
en_us: After that, Cai Jinjian, who could've very likely become a hindrance on his path to pursuing the Great Dao, had been killed right before his very eyes. Not only were his hands clean of her blood, he could take the two pouches of gold essence copper coins in her possession free of charge, and perhaps he would even be able to find a couple of secret treasures from the Dawn Cloud Mountain on her body. Even if those treasures weren't the best that the Dawn Cloud Mountain had to offer, they definitely wouldn't have been far from that caliber. He was confident that Cai Jinjian wouldn't have entered the town without any treasures to protect her. As an example, he was carrying a pair of extremely powerful treasures himself. Aside from that Old Dragon Rainbringer, which was nothing more than a red herring, the other treasures in his possession were just about the best that the Old Dragon City had to offer.

source: 然后权势滔天的大骊藩王说了一个莫名其妙的言语，“陈平安，我相信你感觉得到一句话的真假。”
en_us: Song Changjing paused here momentarily, then said something that was a little puzzling: "Chen Ping'an, I trust that you can sense whether you're being lied to or not."

source: 然后老人瞥了眼宁姚，没好气道：“让他自己坐在长凳上！”
en_us: He then glanced at Ning Yao and snapped, "Let him sit on the bench by himself!"

source: 然后补充了一句，“最少今天不是。”
en_us: She then added, "At the very least, that wasn't his intention today."

source: 然后负剑男人转头望向后撤一步的握刀少年，眼神中带着毫不掩饰的赞许激赏，轻声笑道：“你们两个这次交手，打得都不错。”
en_us: The man turned around to look at Chen Ping'an who had taken a step back with the dagger still in his hand. There was unconcealed approval and appreciation in his eyes as he chuckled softly and said, "You both did quite well."

source: 然后身体腾空的少女又脚尖一点，这一次脚尖力道稍大，脚踝也有拧转，所以并非笔直后仰跳去，而是向右侧蹦跳而去。
en_us: While she was in midair, Ning Yao lightly tapped her feet again, this time exerting a little more power and also twisting her toes, causing her to jump to the side instead of straight back.

source: 然后这个在风雷园以跋扈著称的年轻剑修，闭上眼睛，双手合十，碎碎念祷告道：“千万别是倾国倾城的苏仙子，小子我跪求不是苏仙子大驾光临，要不然我出剑还是不出剑？苏仙子看我一眼，我就要酥了，哪里舍得祭出飞剑”
en_us: He then closed his eyes and brought his palms together as he prayed, "Please don't let it be Celestial Maiden Sun. She's too beautiful! I'm praying to any god out there that's willing to listen to me, please don't let it be Celestial Maiden Su! Otherwise, how can I bring myself to attack her? Just a single glance from her is enough to make me melt into a puddle, I wouldn't be able to bear the thought of attacking her!"

source: 然后这些不断涌现的雨珠，违反常理地哗啦啦向天空滑去。
en_us: Following their emergence, these droplets of rain cascaded up toward the heavens, completely going against the natural order.

source: 然后陈平安跟着少女一起走向那尊道家灵官神像，站在泥塑彩绘神像之前，宁姚向前踏出一步，双手分别按住刀鞘和剑鞘，英姿勃发，她仰头喊道：“我叫宁姚！今天你只要将脚下这三尺立足之地，赠送给我，那么将来我宁姚成就剑仙之境，一定偿还你百倍千倍！”
en_us: Chen Ping'an followed Ning Yao as she walked up to the statue of the Daoist Enforcer. Standing before the colorful statue, Ning Yao took a step forward before placing her hands on her scabbards in a gallant manner. She then looked up and shouted, "I'm Ning Yao! If you're willing to give me your one meter wide base today, I'll repay you 100-fold or even 1000-fold when I become a Sword Immortal in the future!"

source: 然后，孩子骇然瞪大眼睛，只见白茫茫之中，有一条巨大的躯干破开云雾，缓缓移动。
en_us: His eyes then widened with shock as he could see an enormous torso slowly moving through the cloud and mist.

source: 然后，就有了蔡金简踩中狗屎这一幕。
en_us: And now, she had trodden on dog shit.

source: 煎药是一件像是线穿针眼的细致活，陈平安做得有板有眼，沉侵其中，少年身上散发出一种莫名其妙的快乐。
en_us: Like threading a needle, breweing medicine was also a delicate task. Chen Ping'an was very calm and methodical as he focused on the pot of medicine before him. A mysterious sense of happiness radiated from the young boy's body.

source: 照理说两人身份天壤之别，婢女稚圭却极为不卑不亢，甚至当下气势还要隐约压过儒士半头，讥笑道：“善意？数千年来，你们这些了不得的修行中人，高高在上，画地为牢，拿此地作为一块庄稼地，今年割一茬明年拔一捆，年复一年，千年不变，怎么到了现在，才开始想起要与我这孽障‘与人为善’了，哈哈，我听少爷说过一句话，被你们很多人奉为圭臬，叫做非我族类，其心必异，对吧？所以说也怪不得齐先生，毕竟……”
en_us: As aforementioned by Zhi Gui, Qi Jingchun was the master of this realm, while she was only a maidservant that resided in it, but not only was she not displaying any sign of inferiority in Qi Jingchun's presence, it almost seemed as if she were the pre-eminent figure of the two. A mocking sneer appeared on her face as he scoffed, "A piece of 'friendly' advice? For thousands of years, high and mighty cultivators like yourself have treated this place like a plot of farmland, harvesting it for all its worth year after year without remorse or apology. Why is it that all of a sudden, you're trying to extend an olive branch to a disgusting creature like myself? I've heard a saying from my young master that many of you like to preach, stating that those of a different race or ethnicity cannot be trusted, isn't that right? If I look at it that way, I suppose I can't blame you. After all... "

source: 爷俩小指拉钩，拇指上翻后紧紧挨着。
en_us: With their pinkie fingers interlaced, the promise was sealed.

source: 爹娘死后有多少年，便想了有多少年。
en_us: As for exactly how many years, it was the same as the number of years that had passed since his parents had left this world.

source: 片刻之后，数道隐蔽身影，从泥瓶巷对面屋顶落在小巷，或是院门外的小巷当中悄然出现。
en_us: A short moment later, several hidden figures either jumped down from the roof on the opposite side of Clay Vase Alley or appeared from elsewhere in the alley.

source: 片刻之后，老妪身影消失不见，但是在青牛背和石拱桥之间的溪水中，好像有一抹幽绿暗影，歪歪扭扭向下游。
en_us: Moments later, she completely vanished into the water, but a green shadow could be seen swimming downward in a zigzag fashion in the water between the Azure Cow Ridge and the stone bridge.

source: 牌坊楼下，少女转头，杀气冲天。
en_us: Meanwhile, the young woma under the archway turned around with unbridled killing intent rising up from her body.

source: 牛车上五个孩子，叽叽喳喳，热热闹闹。
en_us: The five children on the ox-drawn carriage were all chatting spiritedly among themselves, and the coach driver was an unfamiliar middle-aged man, seated behind whom was the school's former janitor.

source: 牵着男孩的中年妇人，轻轻咳嗽了一下，孩子这才稍稍收敛。
en_us: The middle-aged woman holding onto the boy's hand cleared her throat quietly, and only then did the boy display some restraint.

source: 狠狠撞在一起！
en_us: The two forces clashed violently, creating a marvellous spectacle to behold, but Qi Jingchun paid no heed to the scene that was unfolding above him.

source: 狭刀先至，对那位正阳山护山老祖当头劈下，老猿竟是随便抬手，以手臂强硬弹开这一刀的锋芒。
en_us: The slender saber arrived first, slashing down at Bai Yuan's head. Bai Yuan casually raised an arm to forcefully deflect the blow.

source: 王朱，王朱。
en_us: Wang Zhu, Wang Zhu...

source: 环顾四周，已经有七口水井的雏形了，井口还留着轱辘架子和围栏，有些井口，不断有人用头顶着簸箕钻出来。
en_us: Looking around, he could see that there were already seven wells taking shape, with frames and walls sitting around the wellheads. In some wellheads, people continued to climb out with baskets on their head.

source: 现出千丈真身的老猿，正要将其扛在背上。
en_us: After unleashing his true form, Bai Yuan was just about to toss the mountain onto his back.

source: 现在他只希望那穷酸少年可别是什么惹祸精。
en_us: Now, he could only hope that Chen Ping'an wasn't a trouble-maker.

source: 现在到了廊桥南端，大难不死的陈平安，回头再来看那位青衣少女，少年的心境也大不一样。
en_us: After surviving a great calamity, Chen Ping'an's state of mind was completely different as he arrived on the southern end of the covered bridge and visited the young girl in green again.

source: 现在这条无名小溪，落在草鞋少年眼里，那就是一座躺着金银铜钱的宝库了。
en_us: Right now, in the eyes of this young boy in straw sandals, this nameless creek was like a treasure trove full of gold, silver, and copper coins.

source: 现如今，宁姚又多看到一幕。
en_us: Today, Ning Yao witnessed something new.

source: 珠！
en_us: Their pearl!

source: 璀璨火花照映之下，少女如一尊火神降世。
en_us: Brilliant sparks flew into the air, illuminating the young girl's face and making her appear like a goddess of flames.

source: 生长于乡间野水，好似带着一股青草香的少女，与那些高檐大宅、庭院深深的大家闺秀，做派到底是不一样的。
en_us: Having been born and bred in this rural town, Zhi Gui had a very simple and down-to-earth disposition that set her apart from the young women born to wealthy and powerful families.

source: 用宋集薪的话说就是天生穷苦命，哪怕有福气进了家门，他陈平安也兜不住留不下。宋集薪经常说一些晦涩难懂的话语，约莫是从书籍上搬来的内容，陈平安总是听不太懂，例如前两天念叨什么料峭春寒冻杀少年，陈平安就完全不明白，至于每年熬过了冬天，入春之后有段时日反而更冷，少年倒是切身体会，宋集薪说那就叫倒春寒，跟沙场上的回马枪一样厉害，所以很多人会死在这些个鬼门关上。
en_us: In Song Jixin's words, Chen Ping'an was destined to lead an impoverished life, and even if the winds of fortune were to blow into his home, he wouldn't be able to keep it anyway. Song Jixin often said some things that were very difficult to understand. He most likely took those esoteric sayings from the books that he read, and Chen Ping'an was often left scratching his head in befuddlement. For example, a few days ago, Song Jixin had been saying something something along the lines of "beware of the spring chill, for it has been the death of many a young man", and Chen Ping'an had no idea what that meant. However, he had first-hand experience of the strange phenomenon where the initial period of spring felt colder than the winter each year. Song Jixin referred to this phenomenon as the unexpected spring chill, which caught many people off guard before claiming their lives, much like a sudden and unforeseen retaliation from an opponent on the battlefield.

source: 男人yi笑置之。
en_us: The man replied with a smile.

source: 男人一句话就摆平了少年。
en_us: "You're severely underestimating my reputation," Song Changjing replied in a nonchalant manner.

source: 男人一手拍打肚子，一手扶住腰间那根白玉带，哈哈笑道：“到了京城自然如此，在这里便无妨了，既无庙堂家犬，也无江湖野狗，不会有人逮着本王一顿乱咬。”
en_us: The man rested one hand on his stomach and one hand on his belt as he laughed heartily and said, "That's naturally the case when we return to the capital. Here, however, it doesn't matter too much. There's no guard dog outside the temples, nor are there the wild dogs of the cultivation world. No one will latch onto me and try to bite me all over."

source: 男人一手撑膝，一手托腮，望向远处。在讲述追杀过程的间隙，会时不时穿插一些不为人知的小镇密事，或是一些随心所欲的修行感悟。
en_us: Song Changjing had his elbow resting on his knee, and his chin resting on his hand as he peered into the distance. While describing the chase to Song Jixin, he would also occasionally throw in a few obscure secrets of the town or some casual cultivation insights that he had developed.

source: 男人一直没有松开少年的手腕，面无表情，淡然道：“我哪里知道堂堂正阳山，这回竟然如此不讲规矩。”
en_us: The man didn't let go of the young boy's wrist, and his face was expressionless as he said in a calm voice, "I didn't expect the Sun Scorch Mountain to be so unreasonable this time."

source: 男人一笑置之，“这种豪言壮语，换成泥瓶巷少年来说，是不是更有说服力？”
en_us: The man smiled in reply, saying, "Will these words be more persuasive if they're spoken by that young boy from Clay Vase Alley?"

source: 男人一笑置之，提议道：“我出手救下马苦玄，算我欠你一个人情，所以我出去之后，会说服正阳山搬山猿放弃对你们两个的追杀，如何？”
en_us: The man smiled when he saw this, and he said in suggestion, "Since I stepped in to save Ma Kuxuan, I'll repay you by doing you a favor. After I leave, I'll convince the Mountain-moving Ape from Sun Scorch Mountain to abandon his pursuit of you two. How does that sound?"

source: 男人下定决心，握住腰间那枚虎符后，沉声道：“齐先生，此事不容小觑，你有你的规矩，我也有我的苦衷，希望齐先生接下来莫要插手此事。”
en_us: The man reached a decision, and he grabbed the tiger talisman hanging by his waist and said in a solemn voice, "Mr. Qi, this matter can't be swept under the carpet. You have your rules, but I also have my considerations. I hope that you won't interfere in a while."

source: 男人不以为意。
en_us: The man didn't pay any heed to this.

source: 男人不再卖关子，玩味道：“凭什么？当然凭本王是个天字号的大倒霉秧子，竟然会是你小子的亲叔叔。”
en_us: The man didn't keep Song Jixing guessing anymore, saying in an amused voice, "Why? It's naturally because I'm an extremely unfortunate person. I'm actually your uncle!"

source: 男人不用转头看，都能感受到傻丫头的蹩脚演技，无奈道：“算了，你吃吧，爹就当你今天只吃了yi块红烧肉。记得下午打铁，别再偷懒了。”
en_us: Without even turning around, the man could still sense the abhorrent acting skills of his daughter. He could only sigh and say in exasperation, "Don't worry about it; you can have it yourself. I'll pretend that you only ate a single piece of braised pork belly today. However, remember not to slack off when you forge iron in the afternoon."

source: 男人不觉得自己有流露出蛛丝马迹，这位权势藩王眼神出现一抹讶异之色，微笑笑道：“陈平安，我不是瞧不起你，故意刁难你，恰恰相反，我觉得你这个人有意思，才愿意花时间，心平气和跟你讲道理，做买卖，明白吗？”
en_us: A hint of surprise appeared in the man's eyes, and he smiled as he said, "Chen Ping'an, I'm not looking down on you or intentionally making things difficult for you. On the contrary, I think you're a very interesting person, and that's why I'm willing to spend the time to explain these things to you, do you understand?"

source: 男人不说话。
en_us: The man remained silent.

source: 男人也坐在台阶上，双手撑在膝盖上，举目远眺。
en_us: Sitting next to the young boy, the man placed his hands on his knees and gazed into the distance.

source: 男人伸手指向极远处，是小溪离开群山之出口处，笑道：“山林之间，蛇有蛇道，屋舍之内，鼠有鼠路。至于这江河溪涧之中，则是蛟有蛟道。”
en_us: The man pointed far into the distance, toward the area where the creek flowed down from the mountains. He smiled and said, "Inside the mountains, the snakes have their own Dao. Inside buildings and houses, the rats have their own path. As for the rivers and creeks, the flood dragons residing within naturally have their own Dao as well."

source: 男人伸手绕到后背，拍了拍剑鞘，微笑道：“除了这把剑，师父孑然一身，身死即道消，你报仇有何用？”
en_us: The man reached behind himself and patted the scabbard of his sword, saying with a faint smile, "Apart from this sword, I have no other relatives. If I'm killed, what's the point of seeking revenge for me?"

source: 男人傲然笑道：“我兵家剑修，自古便是天下杀力第一！”
en_us: The man smiled proudly and replied, "Ever since ancient times, us swordsman have always possessed the most ferocious ability to kill."

source: 男人其实最后这句话一说出口，就有些后悔了。没办法，到了自家闺女这边，汉子总管不住最后一句肯定拆台的言语。好在这回少女竟是没有觉得如何委屈，快步跑出屋子，留下一个心情复杂的男人。
en_us: As that final sentence left his mouth, Master Ruan was already regretting his harsh words. However, when it came to his daughter, he simply couldn't help but want to see her improve, and that often led to his scathing criticism of her. Thankfully, this time, Ruan Xiu didn't take his harsh words to heart, and she quickly rushed out of the room, leaving Master Ruan to look on with mixed emotions.

source: 男人卖了一个关子，“真武山不同于东宝瓶洲其它宗门，你上山之后就会明白。”
en_us: "True Martial Mountain is different from the other sects in the Eastern Treasured Vial Continent. You'll understand when you get there," the man said.

source: 男人反问道：“本王在大骊王朝，已经打遍山上山下无敌手，如果再没有一点怕的东西，岂不是比那个坐龙椅的人，还舒坦？小子，你觉得这像话吗？”
en_us: The man retorted, "I've already defeated all opponents and become peerless in the Great Li Empire. If there's nothing that I'm afraid of, won't I be in an even more comfortable position than the person on the throne? Do you think that makes sense?"

source: 男人叹了口气，道：“唯独这把剑，从悬挂在桥下的第一天起，就不是针对什么蛟龙走江的，而是被圣人用来镇压那口锁龙井的出口，所谓出口，也就是桥底下的那口深潭，防止龙气流溢涣散过快，以免将这一方小天地给强行撑破。”
en_us: The man sighed and continued, "Only the sword here wasn't placed to target flood dragons or whatnot. Ever since the first day, it was placed here to suppress the exit of the Dragon Locking Well. The so-called exit is that deep pool under under the covered bridge. The sword hangs above it to prevent the Dragon Qi from dissipating too quickly and forcefully causing this small world to explode."

source: 男人吃完饭，望向小溪那边的妇人和少年，说道：“这小子只要yi天不登中五境，爹就不会管他的死活。哪怕进入中五境，爹会管yi两次，但也绝不会多管，事不过三吧。福祸无门，惟人自召。”
en_us: After finishing his lunch, the man looked at the young boy and woman by the creek and said, "Your father won't care about that young boy's life or death for as long as he doesn't reach the Middle Five Tiers. After he reaches the Middle Five Tiers, I'll step in to save him if it's necessary. However, I'll only do so once or twice, and definitely not more than three times. Each person needs to deal with their own fate."

source: 男人后背被重重一磕，撞了“墙壁”的青衣少女，抬头后一脸茫然，突然看到陈平安，她刚想要笑，猛然转身背对着陈平安，少女手忙脚乱擦拭嘴角。
en_us: Something slammed into the man's back. The young girl in green looked up in a daze after running into the "wall", and upon suddenly seeing Chen Ping'an, she was just about to greet him with a smile. However, she immediately turned her back to him instead, hurriedly using her hands to wipe her mouth.

source: 男人呵呵yi笑，问道：“那么藏在碗底的那块红烧肉，吃不着，会不会感到可惜啊？”
en_us: The man chuckled and asked, "Then will it be a pity if you can't eat that other piece of braised pork belly hidden at the bottom?"

source: 男人哀叹一声，把陈平安晾在一边，继续前行。
en_us: The man sighed in sorrow. He ignored Chen Ping'an and continued to walk forward.

source: 男人哈哈大笑。
en_us: The man roared with laughter.

source: 男人哈哈笑道：“我很厉害？是你家那个黑衣少女告诉你的吧？嗯，由此可见她的武学天资极好，比你那个叫刘羡阳的朋友还要好。实话告诉你好了，我只会杀人，救人实在不擅长。再说了，我凭什么要为了一个只有一面之缘的少年，坏了这里奉行千年的大规矩？”
en_us: The man burst into laughter upon hearing this. "I'm a very powerful man? That young woman from last time must've told you that, right? Judging from that, she must possess exceptional aptitude for martial arts, even more so than your friend, Liu Xianyang. Let met tell you the truth: I only know how to kill people, and I'm really not very good at savying people. Besides, why would I break an ironclad rule that's been honored for thousands of years here just for a young man that I've only met once?"

source: 男人哑然失笑，伸手指了指锋芒毕露的少年，摇头道：“这些大逆不道的言语，你也真敢说，太不知轻重利害了，以后到了京城也好，还是去山上某座仙家府邸，暂避风头，本王劝你一句，别如此言行无忌，否则肯定会倒大霉的。”
en_us: Song Changjing couldn't help but chuckle upon hearing this. He pointed at the young boy who was full of vigor, shaking his head and saying, "You truly dared to utter such treasonous words. You're still far too naive when it comes to what can be said in what situation. Whether you go to the capital in the future, or whether you go to some immortal sect to temporarily keep a low profile, I still suggest that you don't speak in such a wilful and wanton manner. Otherwise, you'll definitely bring disaster upon yourself."

source: 男人哭笑不得，揉着额头。
en_us: The man didn't know whether to laugh or to cry as he pinched his forehead.

source: 男人喝了口茶，悠然道：“陈平安，你有没有想过，为何连最不该得到祖荫福报的你，都有了一片槐叶，可是刘羡阳天赋根骨那么好，竟然没有得到一片槐叶，你有没有想过这个问题？”
en_us: Song Changjing took a sip of tea, then continued in a casual voice, "Chen Ping'an, have you considered why it is that someone like you, who is most undeserving of ancestral blessings, received a locust leaf, yet Liu Xianyang didn't receive even a single locust leaf despite his brilliant aptitude for cultivation?"

source: 男人嘀咕了一句，“知之为知之，不知为不知，是知也。什么狗屁话，读书人就是花花肠子，放个屁也要来个九曲十八弯。”
en_us: "Knowing is knowing, and not knowing is not knowing. Such mindset is one of wisdom indeed," Song Changjing muttered. "What a crock of shit. Intellectuals love this kind of wishy-washy nonsense. Even when they fart, they have to come up with a poem with nine verses and 18 twists."

source: 男人嘴唇颤抖，转过头，挤出一个笑脸，“晓得了！”
en_us: The man's lips quivered slightly, but he forced a smile onto his face once again as he turned and said, "Alright!"

source: 男人就是这些孩子里的一个。
en_us: The swordsman was one of these children.

source: 男人开门见山地问道：“陈平安，你来这里，是关于刘羡阳被打伤一事？”
en_us: The man didn't waste any time as he asked, "Chen Ping'an, did you come to see me because of what happened to Liu Xianyang?"

source: 男人很想说些缓和气氛的话，比如闺女你饿了，就在剑炉茅屋那边吃便是，吃完了明天爹再给你去小镇买。
en_us: The man really wanted to say some gentle words to lighten the atmosphere. For example, telling his daughter that she could eat near the forge if she became hungry, and that he would head to town to buy more snacks for her if she finished them all.

source: 男人恼火道：“干啥子？”
en_us: "What?" the man asked in annoyance.

source: 男人想了想，指向远处如黑龙横溪水之上的廊桥，“那座廊桥的建造，是大骊王朝耗费无数心血的大手笔，为只为镇住那柄不起眼的铁剑。试想一下，三千年后，一柄元神残破、流逝殆尽的无主之剑，在整整三千余年后，为了压制它仅剩的那点威势，一座王朝仍是需要付出那么巨大的代价，所求之事，仍然不过是让它休憩片刻”
en_us: The man pondered for a moment before pointing at the covered bridge that looked liked a black dragon lying across a river. "The Great Li Empire exahusted a huge amount of money and effort to construct that covered bridge. The only reason was to suppress that seemingly inconspicuous iron sword. Just think about it. This is a 3000-year-old sword with a damaged soul and no owner. However, in order to suppress its remnant might, an entire empire still needed to pay such a huge price, their goal nothing more than to suppress it for a brief moment."

source: 男人想了想，既然自己还未正式接手齐静春的位置，那么是不是就意味着，自己也可以不用那么讲道理？
en_us: The man pondered over this for a moment. Since he was still yet to officially take over from Qi Jingchun, did this mean that he could also act in an unreasonable manner?

source: 男人想起那个坐镇此地的儒家圣人，嘴角满是鄙夷，冷哼一声。
en_us: As he thought about the Confucian Sage who was presiding over this place, an expression of disdain spread across his face. He humphed coldly.

source: 男人想通其中关节，叹息一声，不急不缓跟在少年身后，始终没有被马苦玄拉开距离。
en_us: Having figured out the situation, the man breathed a sigh. He was unhurried as he followed Ma Kuxuan, and the distance between them remained contant the entire time.

source: 男人感叹道：“傻闺女，只说这偏居yi隅的大骊王朝，知道有多少人吗？两千多万户！这么多天下人，这么多烦心事，你管得过来吗？爹会在接下来的六十年里，从齐静春手里接管小镇，你也别成天乱逛，安心在剑炉这边铸剑练剑，要不然惹了麻烦，爹是管还是不管？”
en_us: The man sighed and continued, "My silly girl, do you know how many people live in this small corner of the world that's the Great Li Empire? Over 20 million families! With so many people in the world and so many troubling matters to deal with, can you truly keep an eye out for everyone? After I take over from Qi Jingchun, I'll be watching over this small town for the next 60 years. At that time, you should also stop running around everywhere. You need to diligently forge and practice your swordsmanship near this blacksmith forge. Otherwise, if you go out and cause trouble, should your father help you or not?"
